app/views/posts/show.html.erb

       <div class="comment_box">
        <% @post.comments.each do |comment| %>
         <% if comment.gouttes.count >= 1 %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 9]]
SELECT COUNT(*) FROM "gouttes" WHERE "gouttes"."comment_id" = ?  [["comment_id", 3]]

             <% if @post.user == current_user %>
              <% if Goutte.exists?(user_id: current_user.id, comment_id: comment) %>
---
SELECT  1 AS one FROM "gouttes" WHERE "gouttes"."user_id" = ? AND "gouttes"."comment_id" = ? LIMIT ?  [["user_id", 1], ["comment_id", 4], ["LIMIT", 1]]


       <h4 class="answer">回答<%= @post.comments.count %>件</h4>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 8]]

        <% @post.comments.each do |comment| %>
         <% if comment.gouttes.count < 1 %>
---
SELECT COUNT(*) FROM "gouttes" WHERE "gouttes"."comment_id" = ?  [["comment_id", 3]]

             <% if @post.user == current_user %>
              <% if Goutte.exists?(user_id: current_user.id, comment_id: comment) %>
---
SELECT  1 AS one FROM "gouttes" WHERE "gouttes"."user_id" = ? AND "gouttes"."comment_id" = ? LIMIT ?  [["user_id", 1], ["comment_id", 4], ["LIMIT", 1]]