app/controllers/gouttes_controller.rb

SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = ? AND "comments"."id" = ? LIMIT ?  [["post_id", 7], ["id", 1], ["LIMIT", 1]]
INSERT INTO "gouttes" ("user_id", "comment_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["comment_id", 1], ["created_at", "2018-11-21 08:52:52.098904"], ["updated_at", "2018-11-21 08:52:52.098904"]]
---
  def create
    #binding.pry
    #comment = Comment.find(params[:comment_id])
    #goutte = current_user.gouttes.new(goutte_params)
    #goutte.comment_id = comment.id

    comment = Comment.find_by(post_id: params[:post_id], id:params[:comment_id])
    goutte = current_user.gouttes.new(comment_id: comment.id)
    goutte.save

SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = ? AND "comments"."id" = ? LIMIT ?  [["post_id", 7], ["id", 1], ["LIMIT", 1]]
SELECT  "gouttes".* FROM "gouttes" WHERE "gouttes"."comment_id" = ? LIMIT ?  [["comment_id", 1], ["LIMIT", 1]]
DELETE FROM "gouttes" WHERE "gouttes"."id" = ?  [["id", 2]]
---
  def destroy
     comment = Comment.find_by(post_id: params[:post_id], id:params[:comment_id])
     goutte = Goutte.find_by(comment_id: comment.id)
     #binding.pry
     if goutte.destroy