app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id
    #binding.pry
      if @post.save
---
INSERT INTO "posts" ("user_id", "title", "text", "genre", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def destroy
    @post = Post.find(params[:id])
    #binding.pry
    @post.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 7]]