app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "profile_image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["profile_image_id", "1c30b7c9baf062c25a765dc91bb9cfb1ca6c8688836df58bc4b04c2003a3"], ["updated_at", "2018-12-18 10:47:18.761252"], ["id", 1]]
---
  def update
    user = User.find(params[:id])
      if user.update(user_params)